package ice.content.block

import ice.content.block.crafter.*
import universecore.world.Load

@Suppress("unused")
object CrafterBlocks :Load {
  val 焚烧炉 = 焚化炉()
  val 碳控熔炉 = 碳控熔炉()
  val 普适冶炼阵列 = 普适冶炼阵列()

  val 铸铜厂 = 铸铜厂()
  val 特化冶炼阵列 = 特化冶炼阵列()

  val 硫化物混合器 = 硫化物混合器()
  val 爆炸物混合器 = 爆炸物混合器()
  val 低温混合器 = 低温混合器()

  val 单晶硅厂 = 单晶硅厂()
  val 等离子蚀刻厂 = 等离子蚀刻厂()

  val 矿石粉碎机 = 矿石粉碎机()
  val 蜂巢陶瓷合成巢 = 蜂巢陶瓷合成巢()
  val 冲压锻炉 = 冲压锻炉()
  val 暮白高炉 = 暮白高炉()
  val 玳渊缚能厂 = 玳渊缚能厂()
  val 萃取固化器 = 萃取固化器()
  val 电弧炉 = 电弧炉()
  val 增压铈萃取器 = 增压铈萃取器()
  val 导能回路装配器 = 导能回路装配器()
  val 高速粉碎机 = 高速粉碎机()
  val 钴钢压缩机 = 钴钢压缩机()
  val 以太封装器 = 以太封装器()
  val 陶钢熔炼炉 = 陶钢熔炼炉()
  val 高能陶钢聚合炉 = 高能陶钢聚合炉()
  val 铈凝块混合器 = 铈凝块混合器()

  val 生物钢重组器 = 生物钢重组器()
  val 血浆过滤器 = 血浆过滤器()
  val 血肉分离机 = 血肉分离机()
  val 密匙编译器 = 密匙编译器()

  val 电解机 = 电解机()
  val 渗透分离槽 = 渗透分离槽()
  val 反应仓 = 反应仓()
  val 燃烧室 = 燃烧室()
  val 真空坩埚 = 真空坩埚()
  val 干馏塔 = 干馏塔()
  val 激光解离机 = 激光解离机()

  val 洗矿机 = 洗矿机()
  val 结晶器 = 结晶器()

  val 热能冶炼炉 = 热能冶炼炉()
  val 蒸馏净化器 = 蒸馏净化器()
  val 渗透净化器 = 渗透净化器()
  val FEX相位混合器 = FEX相位混合器()

  val 燃料封装机 = 燃料封装机()
  val 气体相位封装机 = 气体相位封装机()
  val 热能离心机 = 热能离心机()
  val 晶格构建器 = 晶格构建器()
  val FEX充能座 = FEX充能座()
  val 矩阵切割机 = 矩阵切割机()
  val 中子透镜 = 中子透镜()
  val 聚合引力发生器 = 聚合引力发生器()
  val 质量生成器 = 质量生成器()
  val 物质逆化器 = 物质逆化器()

  val 强子重构仪 = 强子重构仪()
  val 析构器 = 析构器()
}